source/.NET Standard/Unimake.Business.DFe/Servicos/Config/NFSe/SerraES.xml

<?xml version="1.0" encoding="utf-8"?>
<Configuracoes>
	<Servicos ID="NFSe">
		<RecepcionarLoteRps versao="1.00">
			<Descricao>Recepcionar Lote RPS</Descricao>
			<WebEnderecoProducao>http://apps.serra.es.gov.br:8080/tbw/services/WSEntrada?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.sil.com/"><soapenv:Header/><soapenv:Body><web:nfdEntrada><cpfUsuario>{MunicipioUsuario}</cpfUsuario><hashSenha>{MunicipioSenha}</hashSenha><codigoMunicipio>{CodigoMunicipio}</codigoMunicipio>{xmlBody}</web:nfdEntrada></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<ConverteSenhaBase64>true</ConverteSenhaBase64>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS></TargetNS>
		</RecepcionarLoteRps>
		<CancelarNfse versao="1.00">
			<Descricao>Cancelar nota fiscal de serviço</Descricao>
			<WebEnderecoProducao>http://apps.serra.es.gov.br:8080/tbw/services/WSEntrada?wsdl</WebEnderecoProducao>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.sil.com/"><soapenv:Header/><soapenv:Body><web:nfdEntradaCancelar><cpfUsuario>{MunicipioUsuario}</cpfUsuario><hashSenha>{MunicipioSenha}</hashSenha>{xmlBody}</web:nfdEntradaCancelar></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<ConverteSenhaBase64>true</ConverteSenhaBase64>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS></TargetNS>
		</CancelarNfse>
		<ConsultarNfse versao="1.00">
			<WebEnderecoProducao>http://apps.serra.es.gov.br:8080/tbw/services/WSSaida?wsdl</WebEnderecoProducao>
			<WebActionHomologacao></WebActionHomologacao>
			<WebActionProducao></WebActionProducao>
			<SchemaArquivo></SchemaArquivo>
			<WebContentType>text/xml;charset=UTF-8</WebContentType>
			<WebSoapString><![CDATA[<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.sil.com/"><soapenv:Header/><soapenv:Body><web:nfdSaida><cpfUsuario>{MunicipioUsuario}</cpfUsuario><hashSenha>{MunicipioSenha}</hashSenha>{xmlBody}</web:nfdSaida></soapenv:Body></soapenv:Envelope>]]></WebSoapString>
			<ConverteSenhaBase64>true</ConverteSenhaBase64>
			<WebTagRetorno>S:Body</WebTagRetorno>
			<WebEncodingRetorno>iso-8859-1</WebEncodingRetorno>
			<WebSoapVersion>soap11</WebSoapVersion>
			<SchemaVersao>1.00</SchemaVersao>
			<TargetNS></TargetNS>
		</ConsultarNfse>
	</Servicos>
</Configuracoes>